import fs from 'fs';
import path from 'path';
import axios from 'axios';
import qs from 'qs';

const __dirname = path.resolve();
//const data = JSON.parse(fs.readFileSync(path.join(__dirname, 'data', 'store.json'), 'utf8'));
//const data = JSON.parse(fs.readFileSync(path.join(__dirname, 'store.json'), 'utf8'));

export const image = JSON.parse(fs.readFileSync(path.join(__dirname, 'data', 'image.json'), 'utf8'));

export const build = { 
    "0": "공학관", "1": "공학원", "2": "대우관", "3": "중앙도서관", 
    "4": "삼성관", "5": "언더우드관", "6": "위당관", "7": "경영관"
};

export var storelist = {};

export var storename = {};

export var buildings = {};

export async function findByName(name) {    
    if (!data[name]) {
        return null;
    } 
    data[name][0]["name"] = name;
    if (typeof(data[name][0]["food_image"]) == "string" && typeof(data[name][0]["menu"]) == "string") {
        data[name][0]["food_image"] = data[name][0]["food_image"].split(',');
        data[name][0]["menu"] = data[name][0]["menu"].split(',');
    }
    return data[name][0];
}

export async function getCategoryStore(userdata) {
    const response = await axios.post("http://localhost:3000/model", userdata);
    storelist = response.data;
    //console.log(response.data);
    console.log(storelist);
    return storelist;
}

export async function getCafeteria() {
    const response = await axios.get("http://localhost:3000/cafeteria");
    const cafeteria = response.data;
    console.log(response.data);
    return cafeteria;
}

export async function getEmptyTime() {
    const response = await axios.get("http://localhost:3000/empty");
    const resultTime = response.data;
    console.log(response.data);
    return resultTime; 
}

const a = {
    "한식": ["고기구이", "국밥/해장국", "국수/만두/칼국수", "냉면집", "족발/보쌈", "찌개/국물", "찜닭/닭갈비", "한식/백반/한정식"],
    "일식": ["돈가스", "돈부리/덮밥", "라멘", "샤브샤브", "우동/소바/오뎅", "일식종합", "초밥", "횟집"],
    "중식": ["마라탕", "양꼬치", "중국집"],
    "양식": ["스테이크/폭립", "양식종합", "정통양식/경양식", "파스타/스파게티"],
    "분식": ["라면/김밥/어묵", "떡볶이"],
    "별식/퓨전요리": ["동남아음식", "죽전문점", "타코", "퓨전음식"],
    "닭요리": ["삼계탕", "찜닭/닭갈비", "후라이드/양념치킨"],
    "패스트푸드": ["기타", "도시락", "토스트/샌드위치", "피자", "햄버거"]
}


// getCategoryStore({
//     "username": "찬길",
//     "emptyTime": "1시간",
//     "building": "연희관",
//     "label": "데이트",
//     "Mcategory": "중식",
//     "Scategory": "중국집",
// });

// getCafeteria();


















// export async function getDistance(startx, starty, endx, endy) {
//     const tmapBody = qs.stringify({
//           appKey: 'l7xx02169e57f8f7467ea89c23dcdfd6f33f',
//           startX: startx, //경도
//           startY: starty, //위도
//           endX: endx,     //경도
//           endY: endy,     //위도
//           reqCoordType : "WGS84GEO",
//           resCoordType : "EPSG3857",
//           startName : "출발지",
//           endName : "도착지",
//     });
    
//     const tmap = await axios.post(
//           'https://apis.openapi.sk.com/tmap/routes/pedestrian?version=1&format=json&callback=result',
//           tmapBody,
//           {
//             'Accept-Language': 'ko',
//             'Content-Type': 'application/x-www-form-urlencoded',
//           },
//     );
  
//     const totaltime = tmap.data.features[0].properties.totalTime * 2 / 60 + 30 + 4;
//     console.log(tmap.data.features[0].properties.totalTime / 60 + '분', totaltime);
//     return totaltime;
    
//     //console.log(tmap.data.features[0].properties.totalTime / 60 + '분');
// } 


// export const korean = ["신촌형제갈비", "초가집삼겹살좋아","거북이집한정식","초당쌈밥","소푸리콩나물국밥","감성매인","고바우","밥이답이다","김밥천국","김덕후의차돌조","나나하치","하니앤손스","돈불1971","서서갈비","우리황태","강산애","명물갈비","본우리반상","유채우요리사랑","신촌생고기","불타는곱창","정원식당","생고기짐","한울타리","녹원쌈밥","백년추어탕","틸트","짚불집","군자대한곱창","7번가피자","정통꼬리막창","본죽&비빔밥CAFE","드럼통숯불구이","바나프레소","진솔한식","유닭스토리","알로하토스트랑커피랑","고미정","제주도로담","대성이네","싸움의고수","우정보리밥","웅이네서서갈비","무교동낙지골","금일식당","자연담은화로신촌점","타이스토리","파오","조선의육개장","젊은소나무","내가찜한닭신촌점","육쌈냉면","박가네","신촌부대찌개","일품92하우스","밥한술술한모금","심플리키친","화로상회","초당쌈밥신촌본점","염인돈라멘","돈노코돈먹기","연희식당","고냉지","길상식당","연희동마세","팔색","야채를담다","허니꼬꼬","가우","코블러연희","자연솜씨","빌리지","구구족","형제숯불갈비","탐복","주막보리밥","체셔캣","히우카우","연희곰탕","되새김","엄지식당","수라면옥","맛있는순두부","육구덮밥","랑데자뷰신촌유플렉스","카라멘야","보드게임카페레드버튼신촌","1943","페퍼민트패티","명륜진사갈비","남도벌교음식점","베가니끄","육장갈비","심드렁","리버트리","청송","엄마손","뉴타운","더양","통통돼지","대구삼겹살","만냥하우스","남도밥상","파가니니","선굼터","비하인드리메인","마이헬싱키까페","남도밥상","편의방","콩불","자정","행복은간장밥","드렁크몽크","불밥","아토","정리의밤","언니네양식당","새마을식당신촌점","원조감자탕","제주돈1848","맵:map","피터캣","신촌브루스","토리호람","펀타임","썬더치킨","동학","주반여름","미스터갈매기","빙달","연희녹두삼계탕","최완식참치","돈불","논지당","전주파전","샘터","영심이네원조감자탕","연희동만석집","거북이집","우리들의공간","한옥갈비","다모토리","소신이쏘","우정섞어찌개","책바","옛날집","써브웨이","벽제갈비","쭈꾸미달인","연대북문우리집","미세기","60년전통신촌황소곱창","대현매운족발","고바우","부산완당","참치연","대관령","고기랑","푸드엠파이어","밥이꿀바비꿀","백암순대국","보승회관","2대족발","마미당1948","이층집","키친엑스","고여사집냉면","엄마식탁","연희궁단팥죽","생고기집","설레임삼겹살1989","명륜진사갈비","연세로갈매기","언플러그드","연남닭발","T원연세대","풍국면","코블러","왕가","유야케","윤가네장군집","에노테카오토","동학물갈비","이가네설렁탕","아워온즈","낱낱이봄","통큰갈비","맛깔부대찌개두루치기","두꺼비로멘스","청년밥상문간","사모님돈가스","하루식당","레이씨","연희식객","온달집","엔타로커피","뜸들이다","미정","족발야시장","육칠이_","고기듬뿍미트박스","전주식당","김삼보김치찌개","이가네설렁탕","시도플레이스","로컬식당","굿바이슈가베어","왕족발","아리랑컵밥","육연소","연희보리밥","마포차돌박이","째보식당","시오램","역전포장마차","넙딱집","양꽃","사월","집시포차","신촌장군집","마포화곱창","인쌩맥주","청춘면가","피자클럽","홀리몰리"];
// export const fastfood = ["서브웨이", "한솥연희교차로점","피자스쿨","버거헌터","버거킹연세로점","배스킨라빈스","도미노피자","배스킨라빈스31","본도시락신촌","맥도날드연세대점","배스킨라빈스31CAFE31신촌점","와플잇업","이삭토스트신촌점","피자나라치킨공주","샐러디","한솥","본도시락","롯데리아","고피자","이세계는놀이터에요","피자보이시나","피자앤플랫","파파존스피자","배스킨라빈스31","롯데리아","버거앤쉐이크","노브랜드버거","맘스터치신촌점","서브웨이신촌점","배스킨라빈스","빵사이에낀과일","버거킹연희점","시카고피자전문점연희점","버거킹","샐러디","써브웨이연희점","쉬즈베이글","스테프핫도그","맘스터치","제임스시카고피자","예삐버거","자마버거","수퍼파인","애니브","왓츠유얼컬러","진저","버저비터바스켓"];
// export const chinese = ["연경", "리춘시장","건륭산시도삭면","진미","마라하오","이대마라탕","라화쿵부","화라라마라탕","세아마라탕","가화만사성","청화원","천궁전마라탕","브런치&지엔빙","만추","소시중식레스토랑","이층쌀방","차이797","피슈마라홍탕","신룽푸마라탕","가미","의원상","만남양꼬치","박가네짬뽕","성호각","시누아즈","화명당마라탕","신화장","왕양꼬치","홍콩식당"];
// export const japanese = ["기꾸초밥","강수사","여우골초밥앤참치","와사비횟집","유우","돈부리","이코노스시","스시마쯔","신촌간이회집","어사출또","칼","스시준","원","동강참치","최고의집해물찜&칼국수","마이도야","비스트로카덴","육산","연어상회","개미집","코바코","호루라기","오징어세상","하나","멘야산다이메","소우오뎅","모미지식당","싱싱참치","송","삼호복집","동해해물탕","강릉아구찜","오니기리와이규동","무교동낙지신촌점","벌떡장어","연안식당","사누키","세양수산","월순철판동태찜","시오","파파노다이닝돈부리","고삼이","삼호복집","라임","연어초밥","김판석초밥","미도인","제스의부엌옐로서브마린점","스시가마시","슬기로운횟집생활","리카","신촌돈부리모노","안녕타코","유소바","주간","교토우마이","아소비바","스탠딩타코","쿠리야","연희동와쇼쿠"];
// export const western = ["허프퍼프", "파파노다이닝","부엉이돈까스","현명식탁","센트그릴","장군찜닭","키친별","파스타리코","떼뮤즐렛","쉐프수","황카페","연남장","노란집","돈까스가땡길때","데블다이스","로얄싸롱","이빠네마그릴","쿳사","가고싶은선리네","희게","에어플레인모드","타코벨","보울룸신촌","크로키","타비함박","티앙팡오후의홍차","아비꼬","밀스","신촌카우키","다다","자마레코드","홍대개미신촌점","미네르바","송학","작은스페인","이자카야류","아마스빈","비아37","비아메렝게","아마","아건","아웃백스테이크하우스신촌점","고래파스타","리틀쿠바","마녀주방","우드스탁","카츠업","마세","타코마씸","티아레나","원즈오운","버거리","육식","긴자료코","폴베리","파스타집이야","라드로게리아","메노","볼타","신기루빠","올그릭투미","빽보이피자","인더게러지","인도야시장","플라테이블","오늘와인한잔"];
// export const snack = ["종로김밥", "가야가야","멸치국수잘하는집미정국수0410신촌점","이맛분식","레몬","김밥천국연희점","분식매니아","만나김밥","신전떡볶이","김밥전통만두","김밥전통만두","가마마루이라멘","미스터서왕만두","전골떡볶이","신촌오빠네옛날떡볶이","신계치","천진분식","로봇김밥","쏙만두","미스터호떡","남도분식","막퍼주는집","신촌수제비","포메인","섭이네","한끼마끼","히메지","엄마손김밥","황금찹쌀꽈배기","김밥천국카페","이자카야로바다야카덴","연희김밥","콩","전통만두","두끼떡볶이이대점","연희김밥","역전우동0410","프라이드박스","연희김밥","서른즈음에","민주네김밥","김밥천국","전골떡볶이덕미가","아만도","청년국수","영미김밥","개성만두궁","엄마손김밥","월성분식","키친봄날","홍도깨비","닭한마리","신촌칼국수","걸작떡볶이","가례원","초콜릿책방","궁뜰메밀","서호김밥","가마마루이","항아리수제비","또보겠지떡볶이집","앵란이모네포차","치킨을사랑한떡볶이","떡군이네떡볶이","떡군이네떡볶이","골목분식","신참떡볶이","한강로칼국수","싸다김밥","모센즈스위트","솔로몬라운지"];
// export const fushion = ["백암순대","포베이세브란스점","연희동백암왕순대","아건","본죽앤비빔밥카페신촌점","본죽앤비빔밥카페연희점","국민순대국","홍호아","포히엔베트남쌀국수","본죽&비빔밥","맘맘테이블","전티마이베트남쌀국수","본죽","시래순대국","미스사이공","샤브향","본죽","딴따라독두공방","신촌포가레","하노이포"];
// export const chicken = ["유닭스토리","KFC","두찜","공릉닭한마리","교촌치킨신촌점","BHC치킨","자연담은치킨","멕시칸치킨","공릉닭한마리","닭집추억의옛날통닭","동경닭강정","처갓집양념치킨","굽네치킨","푸라닭","네네치킨","디디치킨","아웃닭","바네스치킨","BHC치킨","처갓집양념치킨","대포찜닭","춘천집닭갈비직영철판구이","훈카츠","연희옥","하림맥시칸치킨","시네마치킨","푸라닭치킨","치킨버스","오늘통닭","베이직프라이드치킨"];
// export const total =  ["기꾸초밥","신촌형제갈비","초가집삼겹살좋아","강수사","종로김밥","거북이집한정식","초당쌈밥","소푸리콩나물국밥","감성매인","연경","고바우","서브웨이","밥이답이다","가야가야","멸치국수잘하는집미정국수0410신촌점","이맛분식","김밥천국","레몬","김덕후의차돌조","나나하치","하니앤손스","돈불1971","허프퍼프","한솥연희교차로점","백암순대","김밥천국연희점","서서갈비","우리황태","강산애","명물갈비","여우골초밥앤참치","본우리반상","분식매니아","유닭스토리","KFC","유채우요리사랑","신촌생고기","만나김밥","불타는곱창","정원식당","신전떡볶이","김밥전통만두","생고기짐","한울타리","피자스쿨","파파노다이닝","와사비횟집","포베이세브란스점","녹원쌈밥","버거헌터","백년추어탕","부엉이돈까스","두찜","틸트","리춘시장","버거킹연세로점","김밥전통만두","짚불집","연희동백암왕순대","가마마루이라멘","건륭산시도삭면","군자대한곱창","현명식탁","아건","7번가피자","정통꼬리막창","본죽&비빔밥CAFE","드럼통숯불구이","배스킨라빈스","도미노피자","바나프레소","배스킨라빈스31","진솔한식","유닭스토리","진미","알로하토스트랑커피랑","센트그릴","공릉닭한마리","교촌치킨신촌점","고미정","본도시락신촌","유우","맥도날드연세대점","BHC치킨","제주도로담","대성이네","미스터서왕만두","전골떡볶이","장군찜닭","배스킨라빈스31CAFE31신촌점","싸움의고수","우정보리밥","웅이네서서갈비","자연담은치킨","키친별","무교동낙지골","돈부리","이코노스시","신촌오빠네옛날떡볶이","금일식당","자연담은화로신촌점","타이스토리","파오","조선의육개장","젊은소나무","멕시칸치킨","스시마쯔","내가찜한닭신촌점","신촌간이회집","와플잇업","어사출또","파스타리코","육쌈냉면","박가네","신촌부대찌개","떼뮤즐렛","일품92하우스","쉐프수","밥한술술한모금","마라하오","신계치","심플리키친","화로상회","천진분식","로봇김밥","초당쌈밥신촌본점","염인돈라멘","쏙만두","돈노코돈먹기","미스터호떡","남도분식","공릉닭한마리","연희식당","황카페","본죽앤비빔밥카페신촌점","고냉지","막퍼주는집","신촌수제비","길상식당","연희동마세","연남장","노란집","이삭토스트신촌점","본죽앤비빔밥카페연희점","피자나라치킨공주","팔색","야채를담다","국민순대국","포메인","허니꼬꼬","칼","돈까스가땡길때","스시준","샐러디","가우","원","한솥","이대마라탕","라화쿵부","데블다이스","로얄싸롱","섭이네","한끼마끼","코블러연희","이빠네마그릴","닭집추억의옛날통닭","쿳사","자연솜씨","홍호아","빌리지","구구족","동경닭강정","본도시락","동강참치","형제숯불갈비","화라라마라탕","탐복","포히엔베트남쌀국수","처갓집양념치킨","주막보리밥","최고의집해물찜&칼국수","체셔캣","가고싶은선리네","희게","히우카우","마이도야","연희곰탕","되새김","엄지식당","비스트로카덴","에어플레인모드","세아마라탕","가화만사성","굽네치킨","수라면옥","맛있는순두부","청화원","육산","연어상회","천궁전마라탕","롯데리아","육구덮밥","브런치&지엔빙","랑데자뷰신촌유플렉스","카라멘야","고피자","만추","소시중식레스토랑","보드게임카페레드버튼신촌","1943","이층쌀방","페퍼민트패티","명륜진사갈비","타코벨","히메지","이세계는놀이터에요","푸라닭","엄마손김밥","보울룸신촌","크로키","피자보이시나","남도벌교음식점","베가니끄","육장갈비","개미집","황금찹쌀꽈배기","심드렁","리버트리","코바코","본죽&비빔밥","호루라기","오징어세상","김밥천국카페","청송","이자카야로바다야카덴","엄마손","뉴타운","더양","타비함박","피자앤플랫","파파존스피자","배스킨라빈스31","연희김밥","콩","티앙팡오후의홍차","통통돼지","전통만두","대구삼겹살","두끼떡볶이이대점","네네치킨","만냥하우스","남도밥상","파가니니","연희김밥","선굼터","디디치킨","롯데리아","버거앤쉐이크","맘맘테이블","비하인드리메인","전티마이베트남쌀국수","마이헬싱키까페","남도밥상","편의방","하나","아비꼬","콩불","자정","멘야산다이메","밀스","신촌카우키","아웃닭","소우오뎅","바네스치킨","역전우동0410","모미지식당","BHC치킨","행복은간장밥","노브랜드버거","맘스터치신촌점","드렁크몽크","불밥","아토","정리의밤","프라이드박스","언니네양식당","새마을식당신촌점","원조감자탕","제주돈1848","맵:map","피터캣","신촌브루스","싱싱참치","다다","토리호람","펀타임","썬더치킨","동학","주반여름","미스터갈매기","본죽","송","자마레코드","삼호복집","동해해물탕","홍대개미신촌점","시래순대국","연희김밥","미네르바","처갓집양념치킨","빙달","서브웨이신촌점","연희녹두삼계탕","송학","미스사이공","최완식참치","돈불","작은스페인","논지당","전주파전","샘터","대포찜닭","영심이네원조감자탕","춘천집닭갈비직영철판구이","서른즈음에","연희동만석집","거북이집","강릉아구찜","우리들의공간","한옥갈비","다모토리","소신이쏘","우정섞어찌개","오니기리와이규동","훈카츠","책바","옛날집","써브웨이","이자카야류","벽제갈비","쭈꾸미달인","연대북문우리집","아마스빈","배스킨라빈스","민주네김밥","김밥천국","전골떡볶이덕미가","미세기","60년전통신촌황소곱창","무교동낙지신촌점","대현매운족발","고바우","부산완당","벌떡장어","차이797","참치연","연희옥","대관령","아만도","청년국수","피슈마라홍탕","빵사이에낀과일","샤브향","하림맥시칸치킨","연안식당","신룽푸마라탕","사누키","비아37","고기랑","세양수산","영미김밥","비아메렝게","개성만두궁","푸드엠파이어","밥이꿀바비꿀","백암순대국","보승회관","월순철판동태찜","2대족발","마미당1948","이층집","키친엑스","버거킹연희점","시네마치킨","아마","아건","시오","파파노다이닝돈부리","엄마손김밥","시카고피자전문점연희점","고여사집냉면","아웃백스테이크하우스신촌점","고래파스타","월성분식","가미","키친봄날","엄마식탁","고삼이","연희궁단팥죽","홍도깨비","닭한마리","생고기집","삼호복집","리틀쿠바","버거킹","설레임삼겹살1989","명륜진사갈비","마녀주방","신촌칼국수","의원상","걸작떡볶이","연세로갈매기","만남양꼬치","가례원","샐러디","라임","우드스탁","언플러그드","연남닭발","T원연세대","풍국면","코블러","초콜릿책방","연어초밥","김판석초밥","박가네짬뽕","궁뜰메밀","왕가","유야케","윤가네장군집","서호김밥","써브웨이연희점","에노테카오토","가마마루이","항아리수제비","성호각","동학물갈비","이가네설렁탕","아워온즈","푸라닭치킨","낱낱이봄","통큰갈비","또보겠지떡볶이집","미도인","앵란이모네포차","치킨을사랑한떡볶이","맛깔부대찌개두루치기","카츠업","제스의부엌옐로서브마린점","스시가마시","두꺼비로멘스","마세","치킨버스","슬기로운횟집생활","청년밥상문간","사모님돈가스","타코마씸","떡군이네떡볶이","쉬즈베이글","스테프핫도그","티아레나","떡군이네떡볶이","맘스터치","하루식당","시누아즈","골목분식","레이씨","연희식객","온달집","원즈오운","엔타로커피","리카","버거리","오늘통닭","뜸들이다","미정","육식","족발야시장","긴자료코","신촌돈부리모노","폴베리","육칠이_","고기듬뿍미트박스","전주식당","김삼보김치찌개","신참떡볶이","본죽","화명당마라탕","제임스시카고피자","한강로칼국수","이가네설렁탕","예삐버거","시도플레이스","신화장","싸다김밥","자마버거","파스타집이야","로컬식당","안녕타코","유소바","굿바이슈가베어","왕족발","아리랑컵밥","육연소","수퍼파인","라드로게리아","연희보리밥","메노","마포차돌박이","볼타","째보식당","딴따라독두공방","주간","베이직프라이드치킨","왕양꼬치","애니브","신기루빠","홍콩식당","시오램","올그릭투미","역전포장마차","빽보이피자","모센즈스위트","넙딱집","양꽃","솔로몬라운지","교토우마이","아소비바","인더게러지","사월","인도야시장","신촌포가레","플라테이블","스탠딩타코","집시포차","왓츠유얼컬러","하노이포","신촌장군집","쿠리야","진저","버저비터바스켓","마포화곱창","연희동와쇼쿠","인쌩맥주","청춘면가","오늘와인한잔","피자클럽","홀리몰리"];


// startX: 126.935968575,
// startY: 37.5614339099,
// endX: 126.9335308,
// endY: 37.55682332,

// navigator.geolocation.getCurrentPosition((pos) => {
//     console.log(pos);
//     var latitude = pos.coords.latitude;
//     var longitude = pos.coords.longitude;
//     console.log("현재 위치는 : " + latitude + ", "+ longitude);
// });

// x-www-form-urlencoded 형식으로 보내야 하기 때문에 qs모듈의 stringify를 사용했다.


